Revit 2026 API

# IDirectContext3DServerCanExecute Method

---

Can be used to allow the server to execute only in certain views.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool CanExecute(
	View dBView
)
```
```vb
Function CanExecute (
	dBView As View
) As Boolean
```
```cpp
bool CanExecute(
	View^ dBView
)
```
```fsharp
abstract CanExecute :
        dBView : View -> bool
```

#### Parameters

dBView View
     The view where rendering will occur.

#### Return Value

Boolean True if the server can be executed in the provided view, false otherwise.

Execution of a DirectContext3D server means that the server is called upon to contribute a bounding box and graphics content (opaque and transparent) for an opened view. The following are some of the conditions that control whether the server is executed:

  1. The return value of this interface method.
  2. Whether the server is one of the active servers for the service.
  3. For servers that use DirectContext3D handles, the visibility of handle instances.

#### Reference

IDirectContext3DServer Interface

Autodesk.Revit.DB.DirectContext3D Namespace